Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Executando terraform plan


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_autoscaling_attachment.asg_attachment_atlantis has been deleted
- resource "aws_autoscaling_attachment" "asg_attachment_atlantis" {
      - alb_target_group_arn   = "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/3efdda83734360cb" -> null
      - autoscaling_group_name = "atlantis_ecs" -> null
      - id                     = "atlantis_ecs-20220318200111506600000001" -> null
    }

  # aws_autoscaling_group.atlantis_ecs has changed
~ resource "aws_autoscaling_group" "atlantis_ecs" {
      ~ desired_capacity          = 0 -> 1
        id                        = "atlantis_ecs"
      ~ max_size                  = 0 -> 2
        name                      = "atlantis_ecs"
        # (21 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment_atlantis will be created
+ resource "aws_autoscaling_attachment" "asg_attachment_atlantis" {
      + alb_target_group_arn   = "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/3efdda83734360cb"
      + autoscaling_group_name = "atlantis_ecs"
      + id                     = (known after apply)
    }

  # aws_ecs_service.atlantis will be created
+ resource "aws_ecs_service" "atlantis" {
      + cluster                            = "arn:aws:ecs:us-east-2:398963803929:cluster/atlantis"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "atlantis"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws:ecs:us-east-2:398963803929:task-definition/atlantis:8"
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "atlantis_container"
          + container_port   = 4141
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/3efdda83734360cb"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://66992d035d8e:4141/lock?id=Matheus-SCosta%252FATLANTIS-ECS%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
